Revit 2026 API

# DimensionSegmentResetTextPosition Method

---

Resets the text position of the segment to the initial position determined by its type and parameters.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ResetTextPosition()
```
```vb
Public Sub ResetTextPosition
```
```cpp
public:
void ResetTextPosition()
```
```fsharp
member ResetTextPosition : unit -> unit
```

The initial point is the text location when dimension is created.

#### Reference

DimensionSegment Class

Autodesk.Revit.DB Namespace